<?php

//Генератор случайных строк для генерации access_token и refresh_token
//$int - это колличество симоволов (45 и 60 соответственно)

//echo randomString(2);
function randomString($int) {
    $array = array (0,1,2,3,4,5,6,7,8,9,'a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z','A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z');
    $string = "";
    for ($i = 0; $i < $int; $i++) {
        $string = "$string".$array[mt_rand(0, (count($array) - 1))];
    }
    return($string);
}

function realTime() {
    date_default_timezone_set('UTC');
    $datetime = date('Y\-m\-d H:i:s');
    return $datetime;
}

function unixRealTime() {
    date_default_timezone_set('UTC');
    $datetime = strtotime(date('Y\-m\-d H:i:s'));
    return $datetime;
}

function htmltostring($val) {
    $val = str_ireplace('<','##s',$val);
    $val = str_ireplace('>','s##',$val);
    $val = str_ireplace('"','^^',$val);
    return ($val);
}

function rus2translit($string) {
    $converter = array(
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '',  'ы' => 'y',   'ъ' => '',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '',  'Ы' => 'Y',   'Ъ' => '',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
        ' ' => '_',
    );
return strtr($string, $converter);
}

function RFsubjects($num) {
    $sub = (array) [
        'Республика Адыгея (Адыгея)',
        'Республика Алтай',
        'Республика Башкортостан',
        'Республика Бурятия',
        'Республика Дагестан',
        'Республика Ингушетия',
        'Кабардино-Балкарская Республика',
        'Республика Калмыкия',
        'Карачаево-Черкесская Республика',
        'Республика Карелия',
        'Республика Коми',
        'Республика Крым',
        'Республика Марий Эл',
        'Республика Мордовия',
        'Республика Саха (Якутия)',
        'Республика Северная Осетия – Алания',
        'Республика Татарстан (Татарстан)',
        'Республика Тыва',
        'Удмуртская Республика',
        'Республика Хакасия',
        'Чеченская Республика',
        'Чувашская Республика – Чувашия',
        'Алтайский край',
        'Забайкальский край',
        'Камчатский край',
        'Краснодарский край',
        'Красноярский край',
        'Пермский край',
        'Приморский край',
        'Ставропольский край',
        'Хабаровский край',
        'Амурская область',
        'Архангельская область',
        'Астраханская область',
        'Белгородская область',
        'Брянская область',
        'Владимирская область',
        'Волгоградская область',
        'Вологодская область',
        'Воронежская область',
        'Ивановская область',
        'Иркутская область',
        'Калининградская область',
        'Калужская область',
        'Кемеровская область',
        'Кировская область',
        'Костромская область',
        'Курганская область',
        'Курская область',
        'Ленинградская область',
        'Липецкая область',
        'Магаданская область',
        'Московская область',
        'Мурманская область',
        'Нижегородская область',
        'Новгородская область',
        'Новосибирская область',
        'Омская область',
        'Оренбургская область',
        'Орловская область',
        'Пензенская область',
        'Псковская область',
        'Ростовская область',
        'Рязанская область',
        'Самарская область',
        'Саратовская область',
        'Сахалинская область',
        'Свердловская область',
        'Смоленская область',
        'Тамбовская область',
        'Тверская область',
        'Томская область',
        'Тульская область',
        'Тюменская область',
        'Ульяновская область',
        'Челябинская область',
        'Ярославская область',
        'Город Москва',
        'Город Санкт-Петербург',
        'Город Севастополь',
        'Еврейская автономная область',
        'Ненецкий автономный округ',
        'Ханты-Мансийский автономный округ – Югра',
        'Чукотский автономный округ',
        'Ямало-Ненецкий автономный округ'
    ];
    return($sub[$num-1]);

}

function listOfSubjectsOptionsHtml() {
    $html = '<option value="">Выберите субьект РФ</option>';
    for ($i = 1; $i <= 85; $i ++) {
        $sub = RFsubjects($i);
        $html = $html . '<option value="'.$sub.'">'. $sub .'</option>';
    }
    return ($html);
}


function docsList($page) {
    if ($page == 'main') {
        $dir = $_SERVER['DOCUMENT_ROOT'] . "/files/filesformainpage";
    } else if ($page == 'coord') {
        $dir = $_SERVER['DOCUMENT_ROOT'] . '/files/filesFromCoordPage';
    }
    $link = str_ireplace($_SERVER['DOCUMENT_ROOT'] . "/",'http://lpptourism.ru/',$dir) . "/";
    $n = 0;
    $html = '';
    for ($i=2; $i < count(scandir($dir)); $i++) {
        $name = scandir($dir)[$i];
        $filedir = $dir . $name;
        //chmod($filedir, 0777);
        $fulllink = $link . $name;
        $html = $html . '<div><a href="'.$fulllink.'">'.$name.'</a></div>';
        $n++;
    }
    return $html;
}

?>
